### TODO:
- Delete redundant columns  
- Rename the columns  
- Drop duplicates  
- Clean individual columns  
- Remove NaN values from the dataset  
- Check for more transformations

In [39]:
import pandas as pd

In [40]:
data = pd.read_csv("zomato_restaurant.csv")  # loading the data into data variable

In [41]:
data.head()  # getting a general feel and looking at the columns of the data

,url,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),reviews_list,menu_item,listed_in(type),listed_in(city)
0,https://www.zomato.com/bangalore/jalsa-banasha...,"942, 21st Main Road, 2nd Stage, Banashankari, ...",Jalsa,Yes,Yes,4.1/5,775,080 42297555\r\n+91 9743772233,Banashankari,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,"[('Rated 4.0', 'RATED\n A beautiful place to ...",[],Buffet,Banashankari
1,https://www.zomato.com/bangalore/spice-elephan...,"2nd Floor, 80 Feet Road, Near Big Bazaar, 6th ...",Spice Elephant,Yes,No,4.1/5,787,080 41714161,Banashankari,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,"[('Rated 4.0', 'RATED\n Had been here for din...",[],Buffet,Banashankari
2,https://www.zomato.com/SanchurroBangalore?cont...,"1112, Next to KIMS Medical College, 17th Cross...",San Churro Cafe,Yes,No,3.8/5,918,+91 9663487993,Banashankari,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,"[('Rated 3.0', ""RATED\n Ambience is not that ...",[],Buffet,Banashankari
3,https://www.zomato.com/bangalore/addhuri-udupi...,"1st Floor, Annakuteera, 3rd Stage, Banashankar...",Addhuri Udupi Bhojana,No,No,3.7/5,88,+91 9620009302,Banashankari,Quick Bites,Masala Dosa,"South Indian, North Indian",300,"[('Rated 4.0', ""RATED\n Great food and proper...",[],Buffet,Banashankari
4,https://www.zomato.com/bangalore/grand-village...,"10, 3rd Floor, Lakshmi Associates, Gandhi Baza...",Grand Village,No,No,3.8/5,166,+91 8026612447\r\n+91 9901210005,Basavanagudi,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,"[('Rated 4.0', 'RATED\n Very good restaurant ...",[],Buffet,Banashankari

In [42]:
data.info() # looking at the data types and seeing if there's nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 17 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   url                          51717 non-null  object
 1   address                      51717 non-null  object
 2   name                         51717 non-null  object
 3   online_order                 51717 non-null  object
 4   book_table                   51717 non-null  object
 5   rate                         43942 non-null  object
 6   votes                        51717 non-null  int64
 7   phone                        50509 non-null  object
 8   location                     51696 non-null  object
 9   rest_type                    51490 non-null  object
 10  dish_liked                   23639 non-null  object
 11  cuisines                     51672 non-null  object
 12  approx_cost(for two people)  51371 non-null  object
 13  reviews_list                 51717 non-null  object
 14  menu_item                    51717 non-null  object
 15  listed_in(type)              51717 non-null  object
 16  listed_in(city)              51717 non-null  object
dtypes: int64(1), object(16)
memory usage: 6.7+ MB

In [43]:
data.shape

(51717, 17)

In [44]:
data.columns

Index(['url', 'address', 'name', 'online_order', 'book_table', 'rate', 'votes',
       'phone', 'location', 'rest_type', 'dish_liked', 'cuisines',
       'approx_cost(for two people)', 'reviews_list', 'menu_item',
       'listed_in(type)', 'listed_in(city)'],
      dtype='object')

In [45]:
columns_to_drop= ['url', 'address','votes', 'phone', 'location', 'rest_type', 'dish_liked', 'cuisines', 
                 'reviews_list', 'menu_item','listed_in(type)', 'listed_in(city)' ]  # a list of unnecessary columns

In [46]:
len(columns_to_drop) # just checking

12

In [47]:
data.drop(columns= columns_to_drop, inplace= True)  # dropping the unnecessary columns

#### Next
- Dropping rows with missing values (NaN)  
- Removing duplicate rows from the dataset

In [48]:
data.isna().sum()

name                              0
online_order                      0
book_table                        0
rate                           7775
approx_cost(for two people)     346
dtype: int64

In [49]:
data = data.dropna()

In [50]:
data.duplicated().sum()

np.int64(28403)

In [51]:
data = data.drop_duplicates()

In [52]:
data.reset_index(inplace= True)  #   resetting my index to reflect all the rows removed

In [53]:
data  # just checking for the changes, looks good

,index,name,online_order,book_table,rate,approx_cost(for two people)
0,0,Jalsa,Yes,Yes,4.1/5,800
1,1,Spice Elephant,Yes,No,4.1/5,800
2,2,San Churro Cafe,Yes,No,3.8/5,800
3,3,Addhuri Udupi Bhojana,No,No,3.7/5,300
4,4,Grand Village,No,No,3.8/5,600
...,...,...,...,...,...,...
15282,51620,Fujian Express,Yes,No,3.8 /5,600
15283,51628,Nook - Aloft Bengaluru Cessna Business Park,No,Yes,4.2 /5,"1,800"
15284,51631,Just Parathas,No,No,3.4 /5,250
15285,51632,SeeYa Restaurant,No,No,3.3 /5,350
15286,51677,Bhagini,No,No,2.5 /5,800

In [54]:
data.drop(columns = 'index', inplace= True)  # dropping the extra added index

In [55]:
new_col_names = []
for i in data:
    new_col_names.append(i.capitalize())    # capitalizing the column names

In [56]:
new_col_names

['Name', 'Online_order', 'Book_table', 'Rate', 'Approx_cost(for two people)']

In [57]:
data.columns = new_col_names

In [58]:
data.rename(columns = {"Approx_cost(for two people)": "cost_for_two"}, inplace= True) # renaming the price columns

In [59]:
data['cost_for_two'] = data['cost_for_two'].str.replace(",", "")   # getting rid of comma in price

In [60]:
data['cost_for_two'] = data['cost_for_two'].astype(int) # converting to int to get rid of .0. It's cleaner that way.

- converting currency from INR -> USD

In [61]:
INR_to_USD = 0.011

In [62]:
data['cost_for_two_usd'] = (data['cost_for_two'] * INR_to_USD).round(0).astype(int)  # converting to USD and rounding to get rid of decimals

In [63]:
data.head()

,Name,Online_order,Book_table,Rate,cost_for_two,cost_for_two_usd
0,Jalsa,Yes,Yes,4.1/5,800,9
1,Spice Elephant,Yes,No,4.1/5,800,9
2,San Churro Cafe,Yes,No,3.8/5,800,9
3,Addhuri Udupi Bhojana,No,No,3.7/5,300,3
4,Grand Village,No,No,3.8/5,600,7

In [64]:
data['Rate'].unique()  # shows unique values in columns

array(['4.1/5', '3.8/5', '3.7/5', '3.6/5', '4.6/5', '4.0/5', '4.2/5',
       '3.9/5', '3.1/5', '3.0/5', '3.2/5', '3.3/5', '2.8/5', '4.4/5',
       '4.3/5', 'NEW', '2.9/5', '3.5/5', '2.6/5', '3.8 /5', '3.4/5',
       '4.5/5', '2.5/5', '2.7/5', '4.7/5', '2.4/5', '2.2/5', '2.3/5',
       '3.4 /5', '-', '3.6 /5', '4.8/5', '3.9 /5', '4.2 /5', '4.0 /5',
       '4.1 /5', '3.7 /5', '3.1 /5', '2.9 /5', '3.3 /5', '2.8 /5',
       '3.5 /5', '2.7 /5', '2.5 /5', '3.2 /5', '2.6 /5', '4.5 /5',
       '4.3 /5', '4.4 /5', '4.9/5', '2.1/5', '2.0/5', '1.8/5', '4.6 /5',
       '4.9 /5', '3.0 /5', '4.8 /5', '2.3 /5', '4.7 /5', '2.4 /5',
       '2.1 /5', '2.2 /5', '2.0 /5', '1.8 /5'], dtype=object)

In [65]:
data['Rate'].value_counts().get('NEW', 0)  # shows how many of a specific value I have in my column

np.int64(793)

In [66]:
data['Rating'] = pd.to_numeric(data['Rate'].str.split('/').str[0], errors='coerce') # takes the rating minus the /5 and turns the invalid ones to NaN vals

In [67]:
data['Rate'].str.replace(' ', '')   # gets rid of extra white space in the Rate column

0        4.1/5
1        4.1/5
2        3.8/5
3        3.7/5
4        3.8/5
         ...
15282    3.8/5
15283    4.2/5
15284    3.4/5
15285    3.3/5
15286    2.5/5
Name: Rate, Length: 15287, dtype: object

In [68]:
data["Rate"] = data['Rate'].str.replace(' ', '')  # applying getting rid of white space

In [ ]:
data  # just analyzing changes, everything looks good

,Name,Online_order,Book_table,Rate,cost_for_two,cost_for_two_usd,Rating
0,Jalsa,Yes,Yes,4.1/5,800,9,4.1
1,Spice Elephant,Yes,No,4.1/5,800,9,4.1
2,San Churro Cafe,Yes,No,3.8/5,800,9,3.8
3,Addhuri Udupi Bhojana,No,No,3.7/5,300,3,3.7
4,Grand Village,No,No,3.8/5,600,7,3.8
...,...,...,...,...,...,...,...
15282,Fujian Express,Yes,No,3.8/5,600,7,3.8
15283,Nook - Aloft Bengaluru Cessna Business Park,No,Yes,4.2/5,1800,20,4.2
15284,Just Parathas,No,No,3.4/5,250,3,3.4
15285,SeeYa Restaurant,No,No,3.3/5,350,4,3.3
15286,Bhagini,No,No,2.5/5,800,9,2.5

In [70]:
data.to_csv("Cleaned_zomato_restaurant.csv", index= False)